target/test-classes/xml/payment/TC2286_createOrder

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <ord1:createOrder type="NEW" correlationId="" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <account type="RESIDENTIAL">
                <contact type="BILLING" language="en_GB">
                    <title>Mr</title>
                    <firstName>LINCOLN</firstName>
                    <lastName>TURNIPSEED</lastName>
                    <telephoneNumbers defaultContact="daytime">
                        <daytime>0398403850</daytime>
                        <evening>0208619999</evening>
                        <mobile>02086999990</mobile>
                    </telephoneNumbers>
                    <emailAddress>tesco.testing@hsntech.com</emailAddress>
                    <birthDate>1975-01-01</birthDate>
                </contact>
                <billingAddress>
                    <buildingIdentifier>30</buildingIdentifier>
                    <addressLine1>LUKIN STREET</addressLine1>
                    <town>LONDON</town>
                    <country>United Kingdom</country>
                    <postcode>E10AA</postcode>
                    <ptc_abs_code>PTCABS23599440</ptc_abs_code>
                    <startDate>1980-08-08</startDate>
                </billingAddress>
                <accountDetail>
                    <username>${#TestCase#emailAddress}</username>
                    <password>password1</password>
                    <securityQuestion>Mothers maiden name?</securityQuestion>
                    <securityAnswer>smith</securityAnswer>
                </accountDetail>
                <billingDetail>
                    <billGroupId>422</billGroupId>
                    <preferredNotification>SMS</preferredNotification>
                    <paymentDetail type="CARD">
                        <creditCard>
                            <cardName>Card</cardName>
                            <cardNumber>4012001038488884</cardNumber>
                            <cardType>MC</cardType>
                            <cardExpiryDate>0330</cardExpiryDate>
                            <cvv>111</cvv>
                        </creditCard>
                    </paymentDetail>
                    <billFormat>SUMMARY</billFormat>
                    <clubcardNumber>634143330730912784</clubcardNumber>
                </billingDetail>
            </account>
            <verification runCreditCheck="false" termsAndConditionsAccepted="false" refundableDepositAccepted="false">
                <interconnect>
                    <param name="PAYASYOUGO"/>
                </interconnect>
            </verification>
            <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
                <dateTime>2011-06-10T16:44:31.0Z</dateTime>
                <orderItem id="1" dealSKU="DEAL-INHAND">
                    <serviceRef reference="Mobile Ref 1"/>
                    <tariff productCode="FC12-1000-500SO">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </tariff>
                    <device productCode="NK-2720">
                        <deliveryMethod>DELIVER</deliveryMethod>
                    </device>
                    <discBundle productCode="00250-SB-A" bundleGroup="SB-GRP-A">
                        <deliveryMethod>INHAND</deliveryMethod>
                    </discBundle>
                </orderItem>
                <paymentRequest>
                    <cardName>Card</cardName>
                    <cardNumber>4012001038488884</cardNumber>
                    <cardType>MC</cardType>
                    <cardExpiryDate>0330</cardExpiryDate>
                    <cvv>111</cvv>
                </paymentRequest>
            </orderDetail>
        </ord1:createOrder>
    </soapenv:Body>
</soapenv:Envelope>